#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2021/12/21 17:30
# @File    : constant.py
# @Software: Basebit
# @Description:

from constant import *

# 原始模板地址
TEMPLATE_PATH = '/Users/jeremy.li/Basebit/Documents/develop/smart/20211013-瑞金门急诊模板配置/20211220-门诊660'
TASK_PATH = os.path.abspath(os.path.dirname(__file__))

# 输出的Excel
EXCEL_RESULT_FOR_CHECK_PATH = '{}/result_for_check_templates.xlsx'.format(TASK_PATH)
PRESENT_FILE_PATH = '{}/现病史第二批.xlsx'.format(TASK_PATH)
TEMPLATE_DISEASE_FILE_PATH = '{}/template_disease_map.xlsx'.format(TASK_PATH)
EXCEL_STANDARD_FILE_PATH = '{}/standard_templates.xlsx'.format(TASK_PATH)

TEMPLATE_BATCHES = {
    2: ['门诊病历(初诊)-鼻部疾病1(4360105)门诊病历(初诊)9bf3b17b-a9f7-4424-88b7-b3147cb60714.html',
        '门诊病历(初诊)-产科(4200100)门诊病历(初诊)adb652ee-023c-4934-847c-c6d665eb0d24.html',
        '肺系疾病-肺气虚寒证(初诊)模板(4090100)肺气虚寒证(初诊)569c1abf-c79f-4213-85f5-ef28a6e9e29f.html',
        '肺系疾病-肺肾两虚证(初诊)模板(4090100)肺肾两虚证(初诊)c1a96a97-7073-4430-963f-a00f6b98b171.html',
        '肺系疾病-肺阴亏耗证(初诊)模板(4090100)肺阴亏耗证(初诊)41898a55-7f6f-4ec1-90e4-b8a18494fe55.html',
        '肺系疾病-风寒犯肺证(初诊)模板(4090100)风寒犯肺证(初诊)5eb880c7-0db2-45f4-b6f9-90f73a6f5b6b.html',
        '肺系疾病-风热犯肺证(初诊)模板(4090100)风热犯肺证(初诊)bae405f3-14d3-476c-a176-6b1ee92b191e.html',
        '肺系疾病-痰热郁肺证(初诊)模板(4090100)痰热郁肺证(初诊)09c8f4bd-cbe6-46f0-9393-5cecf8b2dc34.html',
        '肺系疾病-痰湿蕴肺证(初诊)模板(4090100)肺系疾病-痰湿蕴肺证(初诊)753c4a04-bfd1-49e8-82ae-8f3eaeadf261.html',
        '门诊病历(初诊)-宫颈专病门诊病史(4200200)门诊病历(初诊)275bf5a2-1996-47d6-b344-f063cb190d68.html',
        '门诊病历(初诊)-计划生育手术门诊病史(4200200)门诊病历(初诊)4b75a08e-4da7-4c12-a274-12c87bf75642.html',
        '结肠恶性肿瘤肝气乘脾证(初诊)模板(4090100)结肠恶性肿瘤肝气乘脾证(初诊)640bcb85-0f91-448d-a775-ee0d96dc87df.html',
        '结肠恶性肿瘤脾肾阳虚证(初诊)模板(4090100)结肠恶性肿瘤脾肾阳虚证(初诊)05f19c95-e775-4073-91f7-4f39c7416c9a.html',
        '结肠恶性肿瘤气血两虚证(初诊)模板(4090100)结肠恶性肿瘤气血两虚证(初诊)9be7ebec-5698-4d49-931a-60d2bccfe712.html',
        '结肠恶性肿瘤气滞血瘀证(初诊)模板(4090100)结肠恶性肿瘤气滞血瘀证(初诊)34e3ea6c-5bce-4e24-b1be-14676f9ee3b8.html',
        '结肠恶性肿瘤湿热下注证(初诊)模板(4090100)结肠恶性肿瘤湿热下注证(初诊)311fe4a4-4db5-4227-9b4a-e724ac098490.html',
        '淋巴瘤肝肾阴虚证(初诊)模板(4090100)淋巴瘤肝肾阴虚证(初诊)568334cb-4e0c-473a-bc1a-c07f97feb42a.html',
        '淋巴瘤寒痰凝滞证(初诊)模板(4090100)淋巴瘤寒痰凝滞证(初诊)53203d15-6d35-4189-840f-652c4b988116.html',
        '淋巴瘤脾虚痰湿证(初诊)模板(4090100)淋巴瘤脾虚痰湿证(初诊)1bab484b-7e85-45a6-a34a-f7420bf63382.html',
        '淋巴瘤气血两虚证(初诊)模板(4090100)淋巴瘤气血两虚证(初诊)faa0adf0-c484-46c7-a831-bfbb0d8b75b6.html',
        '淋巴瘤气郁痰凝证(初诊)模板(4090100)淋巴瘤气郁痰凝证(初诊)32a95bc3-840f-4697-b52a-c5ca2ce48863.html',
        '淋巴瘤痰热内蕴证(初诊)模板(4090100)淋巴瘤痰热内蕴证(初诊)1cea51c6-955d-4737-a01e-2f61c7dcb221.html',
        '淋巴瘤痰瘀互结证(初诊)模板(4090100)淋巴瘤痰瘀互结证(初诊)2037180d-c84f-4867-9980-594256bf7932.html',
        '脑病-肝肾阴虚、风阳上扰证(初诊)模板(4090100)脑病-肝肾阴虚、风阳上扰证(初诊)fbb14207-0b0f-4e26-87e9-f3f7bf3e1744.html',
        '脑病-肝阳上抗证(初诊)模板(4090100)脑病-肝阳上抗证(初诊)c842a2d6-a0f7-4b0d-9fd4-c3014acce217.html',
        '脑病-脉络空虚、风邪入中证(初诊)模板(4090100)脑病-脉络空虚、风邪入中证(初诊)b35bb0bb-dce6-4ef8-980c-e0f5535449d0.html',
        '脑病-气虚血瘀证(初诊)模板(4090100)脑病-气虚血瘀证(初诊)5d4d170e-6212-463e-aade-b123b2ec85a1.html',
        '气虚证(初诊)模板(4090100)门诊病历(初诊)367079be-f35f-4df2-bc66-39c8d338514e.html',
        '气滞证(初诊)模板(4090100)门诊病历(初诊)10673e82-ac50-40a3-af0f-0e8efa2a8939.html',
        '痰湿证(初诊)模板(4090100)门诊病历(初诊)bedf42e2-9b56-4f81-9346-254705c080e9.html',
        '血虚证(初诊)模板(4090100)门诊病历(初诊)5309208e-76a3-41ac-b3d6-24b4e3e23075.html',
        '血瘀证(初诊)模板(4090100)门诊病历(初诊)35f534ee-49cb-4c65-b6a7-5fc43a7c907b.html', ]
}
