#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2021/11/26 10:20
# @File    : main.py
# @Software: Basebit
# @Description:
import re

all_files = [
    '4431000-急诊发热-门诊病历(初诊)模板-门诊病历(初诊).html',  # 重新跑数据
    '4360127-九舍门诊眼科-门诊病历(复诊)-眼科(一般)-门诊病历(复诊).html',  # 使用门诊病历(复诊)-眼科
    '4360127-九舍门诊眼科-门诊病历(配药)-眼科-门诊病历(配药).html',  # 本来就为空
    '0080600-护理专病门诊-PICC护理（常规护理）模板-门诊病历(配药).html',  # 使用：护理专病门诊-PICC护理（拔管护理）模板
    '4360117-九舍门诊普内科-通用-配药-门诊病历(配药).html',  # 本来就为空
    '4121601-门诊乳腺中心-门诊病历(配药)-乳腺癌辅助内分泌治疗-门诊病历(配药).html',  # 本来就为空（emr_fererence后面还有东西）
    '4121601-门诊乳腺中心-门诊病历(复诊)-乳房肿块-门诊病历(复诊).html',  # 本来就为空
    '4360117-九舍门诊普内科-通用-复诊-门诊病历(复诊).html',  # 没问题
    '4121601-门诊乳腺中心-门诊病历(复诊)-乳腺增生-门诊病历(复诊).html',  # 本来就为空
    '4350100-营养门诊-营养门诊病历(配药)-门诊病历(配药).html',  # 本来就为空
    '0080600-护理专病门诊-PORT护理（常规护理）模板-门诊病历(配药).html',  # 使用：护理专病门诊-PICC护理（拔管护理）模板
    '4121601-门诊乳腺中心-门诊病历(复诊)-乳腺癌术后-门诊病历(复诊).html',  # 没有问题
    '4121601-门诊乳腺中心-门诊病历(配药)-乳腺癌辅助化疗-门诊病历(配药).html',  # 本来就为空（emr_fererence后面还有东西）
    '4200100-门诊产科-门诊病历(配药)简单-产科-门诊病历(配药).html',  # 本来就为空
    '4280000-门诊推拿科-门诊病历(初诊)-颈型颈椎病-门诊病历(初诊).html',  # 西医诊断没有入库
    '4121601-门诊乳腺中心-门诊病历(配药)-赫赛汀-门诊病历(配药).html',  # 本来就为空（emr_fererence后面还有东西）
    '4240100-门诊口腔科-门诊病历(初诊)-龋齿牙体缺损-门诊病历(初诊).html',  # 重新跑数据
    '4270000-门诊针灸科-门诊病历(复诊)-腰痛-门诊病历(复诊).html',  # 没问题
    '0080600-护理专病门诊-PICC护理（拔管护理）模板-门诊病历(配药).html',  # 重新跑数据
    '4270000-门诊针灸科-门诊病历(复诊)-颈椎病-门诊病历(复诊).html',  # 没问题
    '4121601-门诊乳腺中心-门诊病历(初诊)-乳腺增生-门诊病历(初诊).html',  # 本来就为空
    '4121601-门诊乳腺中心-门诊病历(配药)-乳腺癌新辅助化疗-门诊病历(配药).html',  # 本来就为空
    '1010200-广慈门诊-通用-复诊-门诊病历(复诊).html',  # 没问题
    '4300500-门诊疼痛-门诊病历(初诊)-无痛胃肠镜麻醉-门诊病历(初诊).html',  # 没问题
    '4121601-门诊乳腺中心-门诊病历(配药)-乳腺癌靶向+化疗-门诊病历(配药).html',  # 本来就为空（emr_fererence后面还有东西）
    '4270000-门诊针灸科-门诊病历(复诊)-肩关节痛-门诊病历(复诊).html',  # 重新跑数据
    '4270000-门诊针灸科-门诊病历(复诊)-周围性面瘫-门诊病历(复诊).html',  # 重新跑数据

    '4370500-特需门诊-门诊配药-特需内镜治疗-门诊病历(配药).html',  # 无问题
    '4240100-门诊口腔科-门诊病历(初诊)-洗牙-门诊病历(初诊).html',  # 其他入库有点问题，稍后调整
    '4240100-门诊口腔科-门诊病历(初诊)-智齿阻生牙拔牙-门诊病历(初诊).html',  # 重新跑数据
    '4280000-门诊推拿科-门诊病历(初诊)-腰肌筋膜炎-门诊病历(初诊).html',  # 重新跑数据
    '4431000-急诊发热-门诊病历(复诊)模板-门诊病历(复诊).html',  # 本来就为空
    '4270000-门诊针灸科-门诊病历(复诊)-膝关节痛-门诊病历(复诊).html',  # 无问题
    '4280000-门诊推拿科-门诊病历(初诊)-腰椎间盘突出-门诊病历(初诊).html',  # 重新跑数据
    '4280000-门诊推拿科-门诊病历(初诊)-椎动脉型颈椎病-门诊病历(初诊).html',  # 无问题
    '4121601-门诊乳腺中心-门诊病历(初诊)-乳房肿块-门诊病历(初诊).html',  # 本来就为空
    '4240100-门诊口腔科-门诊病历(初诊)-牙髓炎-门诊病历(初诊).html',  # 无问题
    '4280000-门诊推拿科-门诊病历(初诊)-神经根型颈椎病-门诊病历(初诊).html',  # 无问题
    '4270000-门诊针灸科-门诊病历(初诊)-颈椎病-门诊病历(初诊).html',  # 重新跑数据
    '4270000-门诊针灸科-门诊病历(初诊)-周围性面瘫-门诊病历(初诊).html',  # 没有相关疾病
    '4270000-门诊针灸科-门诊病历(初诊)-腰痛-门诊病历(初诊).html',  # 重新跑数据
    '4270000-门诊针灸科-门诊病历(初诊)-肩关节痛-门诊病历(初诊).html',  # 重新跑数据
    '4350100-营养门诊-营养门诊病历(初诊)-门诊病历(初诊).html',  # 本来就为空
    '4360127-九舍门诊眼科-门诊病历(初诊)-眼科(详细)-门诊病历(初诊).html',  # 使用“门诊病历(初诊)-眼科”
    '4360127-九舍门诊眼科-门诊病历(初诊)-眼科(一般)-门诊病历(初诊).html',  # 使用“门诊病历(初诊)-眼科”
    '4360127-九舍门诊眼科-门诊病历(复诊)-眼科-门诊病历(复诊).html',  # 重新跑数据
    '4360127-九舍门诊眼科-门诊病历(初诊)-眼科-门诊病历(初诊).html',  # 重新跑数据即可
    '4360117-九舍门诊普内科-通用-初诊-门诊病历(初诊).html',  # 本来就为空
    '4121601-门诊乳腺中心-门诊病历(初诊)-乳腺癌辅助内分泌治疗-门诊病历(初诊).html',  # 本来就为空
    '4350100-营养门诊-营养门诊病历(复诊)-门诊病历(复诊).html',  # 本来就为空
    '4121601-门诊乳腺中心-门诊病历(初诊)-乳腺癌辅助化疗-门诊病历(初诊).html',  # 本来就为空
    '4121601-门诊乳腺中心-门诊病历(初诊)-赫赛汀-门诊病历(初诊).html',  # 本来就为空
    '4121601-门诊乳腺中心-门诊病历(初诊)-乳腺癌新辅助化疗-门诊病历(初诊).html',  # 本来就为空
    '4270000-门诊针灸科-门诊病历(初诊)-膝关节痛-门诊病历(初诊).html',  # 重新跑数据
]
tongyong_files = [
    '4431000-急诊发热-门诊病历(初诊)模板-门诊病历(初诊).html',
    '4360127-九舍门诊眼科-门诊病历(复诊)-眼科(一般)-门诊病历(复诊).html',
    '4360127-九舍门诊眼科-门诊病历(配药)-眼科-门诊病历(配药).html',
    '0080600-护理专病门诊-PICC护理（常规护理）模板-门诊病历(配药).html',
    '4360117-九舍门诊普内科-通用-配药-门诊病历(配药).html',
    '4121601-门诊乳腺中心-门诊病历(配药)-乳腺癌辅助内分泌治疗-门诊病历(配药).html',
    '4360117-九舍门诊普内科-通用-复诊-门诊病历(复诊).html',
    '4350100-营养门诊-营养门诊病历(配药)-门诊病历(配药).html',
    '0080600-护理专病门诊-PORT护理（常规护理）模板-门诊病历(配药).html',
    '4200100-门诊产科-门诊病历(配药)简单-产科-门诊病历(配药).html',
    '0080600-护理专病门诊-PICC护理（拔管护理）模板-门诊病历(配药).html',
    '1010200-广慈门诊-通用-复诊-门诊病历(复诊).html',
    '4300500-门诊疼痛-门诊病历(初诊)-无痛胃肠镜麻醉-门诊病历(初诊).html',
    '4370500-特需门诊-门诊配药-特需内镜治疗-门诊病历(配药).html',
    '4240100-门诊口腔科-门诊病历(初诊)-洗牙-门诊病历(初诊).html',
    '4431000-急诊发热-门诊病历(复诊)模板-门诊病历(复诊).html',
    '4240100-门诊口腔科-门诊病历(复诊)-RCT（复诊换药）-门诊病历(复诊).html',
    '0080600-护理专病门诊-配静脉护理产品模板-门诊病历(配药).html',
    '1010200-广慈门诊-检查五官科(初诊)模板-门诊病历(初诊).html',
    '4201500-门诊生殖中心-门诊病历(简易配药)-门诊病历(配药).html',
    '4300500-门诊疼痛-门诊病历(初诊)-麻醉评估-门诊病历(初诊).html',
    '4240100-门诊口腔科-门诊病历(复诊)-拆线（复诊）-门诊病历(复诊).html',
    '4240100-门诊口腔科-门诊病历(复诊)-种植（复诊义齿修复）-门诊病历(复诊).html',
    '4100200-门诊儿内-儿科门诊(复诊)-门诊病历(复诊).html',
    '4180100-门诊伤科-门诊病历(复诊)模板-门诊病历(复诊).html',
    '4240100-门诊口腔科-门诊病历(复诊)-种植（复诊拆线）-门诊病历(复诊).html',
    '4240100-门诊口腔科-门诊病历(初诊)-种植-门诊病历(初诊).html',
    '4300500-门诊疼痛-门诊病历(配药)-开具麻醉药品-门诊病历(配药).html',
    '4360133-九舍门诊推拿-门诊病历(初诊)-推拿科-门诊病历(初诊).html',
    '4240100-门诊口腔科-门诊病历(初诊)-TMD-门诊病历(初诊).html',
    '4100200-门诊儿内-儿科门诊(初诊)-门诊病历(初诊).html',
    '4121800-门诊肿瘤-门诊病历(配药)-门诊病历(配药).html',
    '4350100-营养门诊-营养门诊病历(初诊)-门诊病历(初诊).html',
    '4270000-门诊针灸科-门诊病历(初诊)-通用-门诊病历(初诊).html',
    '4090100-门诊中医内科-中医内科(初诊)模板-门诊病历(初诊).html',
    '4270000-门诊针灸科-门诊病历(复诊)-通用-门诊病历(复诊).html',
    '4360127-九舍门诊眼科-门诊病历(初诊)-眼科(详细)-门诊病历(初诊).html',
    '4360127-九舍门诊眼科-门诊病历(初诊)-眼科(一般)-门诊病历(初诊).html',
    '4360127-九舍门诊眼科-门诊病历(复诊)-眼科-门诊病历(复诊).html',
    '4360127-九舍门诊眼科-门诊病历(初诊)-眼科-门诊病历(初诊).html',
    '4360117-九舍门诊普内科-通用-初诊-门诊病历(初诊).html',
    '4121601-门诊乳腺中心-门诊病历(初诊)-乳腺癌辅助内分泌治疗-门诊病历(初诊).html',
    '4360117-九舍门诊普内科-通用-初诊-门诊病历(初诊).html',
    '4350100-营养门诊-营养门诊病历(复诊)-门诊病历(复诊).html', ]
result = {}

for file in all_files:
    # if file not in tongyong_files:
    #     continue
    print('file:///Users/jeremy.li/Basebit/Documents/develop/smart/20211013-瑞金门急诊模板配置/rawTemplates/{}'.format(file))
    department_code = int(re.findall('(\d+)-', file)[0])
    if '初诊' in file:
        _type = 'INITIAL'
    elif '复诊' in file:
        _type = 'SUBSEQUENT'
    else:
        _type = 'MEDICINE'

    with open('aiwizard.html', 'r') as f:
        html = f.read()
    html = re.sub('deptCode: "(\d+)"', 'deptCode: "{}"'.format(department_code), html)
    html = re.sub('tplType: "(.+)"', 'tplType: "{}"'.format(_type), html)
    with open('aiwizard.html', 'w') as f:
        f.write(html)
    print('打开原始HTML与aiwizard，对比效果')
    print()

print(result)
